soap-camel-client/target/classes/HelloRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="http://learnwebservices.com/services/hello">
   <soapenv:Header/>
   <soapenv:Body>
      <hel:HelloRequest>
         <hel:Name>Sameer</hel:Name>
      </hel:HelloRequest>
   </soapenv:Body>
</soapenv:Envelope>